In [8]:
import pandas as pd
import numpy as np

data = pd.read_csv("data_science_job - data_science_job.csv")
data

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,NaN,NaN,36.0,1
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,47.0,0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5.0,NaN,NaN,83.0,0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,0.0,NaN,Pvt Ltd,52.0,1
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,20.0,50-99,Funded Startup,8.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14.0,NaN,NaN,42.0,1
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14.0,NaN,NaN,52.0,1
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,50-99,Pvt Ltd,44.0,0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,0.0,500-999,Pvt Ltd,97.0,0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2.0,NaN,NaN,127.0,0

In [10]:
data.head(10)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,NaN,NaN,36.0,1
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,47.0,0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5.0,NaN,NaN,83.0,0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,0.0,NaN,Pvt Ltd,52.0,1
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,20.0,50-99,Funded Startup,8.0,0
5,21651,city_176,0.764,NaN,Has relevent experience,Part time course,Graduate,STEM,11.0,NaN,NaN,24.0,1
6,28806,city_160,0.920,Male,Has relevent experience,no_enrollment,High School,NaN,5.0,50-99,Funded Startup,24.0,0
7,402,city_46,0.762,Male,Has relevent experience,no_enrollment,Graduate,STEM,13.0,<10,Pvt Ltd,18.0,1
8,27107,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,7.0,50-99,Pvt Ltd,46.0,1
9,699,city_103,0.920,NaN,Has relevent experience,no_enrollment,Graduate,STEM,17.0,10000+,Pvt Ltd,123.0,0

In [13]:
data.tail()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14.0,NaN,NaN,42.0,1
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14.0,NaN,NaN,52.0,1
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,50-99,Pvt Ltd,44.0,0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,0.0,500-999,Pvt Ltd,97.0,0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2.0,NaN,NaN,127.0,0

In [14]:
data.shape

(19158, 13)

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  18679 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  float64
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  training_hours          18392 non-null  float64
 12  target                  19158 non-null  int64
dtypes: float64(3), int64(2), object(8)
memory usage: 1.9+ MB

In [16]:
data.describe()

,enrollee_id,city_development_index,experience,training_hours,target
count,19158.000000,18679.000000,19093.000000,18392.000000,19158.000000
mean,16875.358179,0.828951,9.928036,65.185787,0.249348
std,9616.292592,0.123334,6.505268,59.885626,0.432647
min,1.000000,0.448000,0.000000,1.000000,0.000000
25%,8554.250000,0.740000,4.000000,23.000000,0.000000
50%,16982.500000,0.903000,9.000000,47.000000,0.000000
75%,25169.750000,0.920000,16.000000,88.000000,0.000000
max,33380.000000,0.949000,20.000000,336.000000,1.000000

In [17]:
data.isnull()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
0,False,False,False,False,False,False,False,False,False,True,True,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,True,False,False,False,False,False,True,True,False,False
3,False,False,False,True,False,True,False,False,False,True,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,False,False,False,False,False,False,False,False,False,True,True,False,False
19154,False,False,False,False,False,False,False,False,False,True,True,False,False
19155,False,False,False,False,False,False,False,False,False,False,False,False,False
19156,False,False,False,False,False,False,False,True,False,False,False,False,False
19157,False,False,False,True,False,False,False,True,False,True,True,False,False

In [18]:
data.isnull().sum()

enrollee_id                  0
city                         0
city_development_index     479
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
training_hours             766
target                       0
dtype: int64

In [62]:
df1 = data.dropna(axis=0)
df1

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,47.0,0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,20.0,50-99,Funded Startup,8.0,0
7,402,city_46,0.762,Male,Has relevent experience,no_enrollment,Graduate,STEM,13.0,<10,Pvt Ltd,18.0,1
8,27107,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,7.0,50-99,Pvt Ltd,46.0,1
9,699,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,17.0,10000+,Pvt Ltd,123.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19147,21319,city_21,0.624,Male,No relevent experience,Full time course,Graduate,STEM,1.0,100-500,Pvt Ltd,52.0,1
19148,9212,city_21,0.624,Male,Has relevent experience,no_enrollment,Masters,STEM,3.0,100-500,Pvt Ltd,40.0,1
19149,251,city_103,0.920,Male,Has relevent experience,no_enrollment,Masters,STEM,9.0,50-99,Pvt Ltd,36.0,1
19152,29754,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,Humanities,7.0,10/49,Funded Startup,25.0,0
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,50-99,Pvt Ltd,44.0,0

In [23]:
df1.shape

(8434, 13)

In [29]:
data[50:100]

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
50,5568,city_101,0.558,Male,No relevent experience,no_enrollment,Graduate,STEM,4.0,NaN,NaN,92.0,1
51,2195,city_64,0.666,Male,Has relevent experience,no_enrollment,Graduate,STEM,10.0,100-500,Pvt Ltd,102.0,0
52,30533,city_105,0.794,Male,No relevent experience,no_enrollment,Graduate,Humanities,5.0,10000+,Pvt Ltd,26.0,0
53,28512,city_104,0.924,NaN,Has relevent experience,no_enrollment,Masters,STEM,3.0,<10,Early Stage Startup,7.0,0
54,1023,city_114,0.926,Male,No relevent experience,Full time course,High School,NaN,4.0,10000+,Pvt Ltd,43.0,0
55,12253,city_104,0.924,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,100-500,Pvt Ltd,NaN,0
56,25296,city_73,0.754,Male,Has relevent experience,Full time course,Graduate,STEM,2.0,50-99,Early Stage Startup,52.0,0
57,13238,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,NaN,NaN,19.0,0
58,13478,city_21,0.624,NaN,Has relevent experience,Full time course,Graduate,STEM,2.0,10/49,Funded Startup,32.0,1
59,18578,city_162,0.767,Male,Has relevent experience,no_enrollment,Graduate,Humanities,20.0,100-500,Pvt Ltd,NaN,1
60,29975,city_67,0.855,Male,Has relevent experience,Part time course,Graduate,STEM,6.0,NaN,NaN,90.0,0
61,26516,city_75,0.939,Male,Has relevent experience,no_enrollment,Graduate,STEM,6.0,100-500,Pvt Ltd,25.0,0
62,24690,city_41,0.827,NaN,Has relevent experience,NaN,Masters,STEM,13.0,<10,NaN,15.0,0
63,8433,city_100,0.887,Male,Has relevent experience,no_enrollment,Masters,Humanities,20.0,100-500,Pvt Ltd,48.0,0
64,9572,city_11,0.550,NaN,No relevent experience,Full time course,High School,NaN,3.0,NaN,NaN,98.0,0
65,5878,city_93,0.865,Male,Has relevent experience,no_enrollment,Graduate,STEM,10.0,50-99,Pvt Ltd,NaN,1
66,25695,city_67,0.855,Other,No relevent experience,no_enrollment,Masters,Humanities,4.0,10000+,Pvt Ltd,13.0,0
67,9645,city_16,0.910,Male,Has relevent experience,no_enrollment,Graduate,STEM,15.0,NaN,NaN,47.0,0
68,12730,city_16,0.910,Female,Has relevent experience,no_enrollment,Masters,Humanities,14.0,500-999,Public Sector,28.0,0
69,4830,city_90,0.698,NaN,No relevent experience,NaN,NaN,NaN,2.0,NaN,Pvt Ltd,228.0,1
70,20970,city_64,0.666,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,NaN,NaN,22.0,0
71,17271,city_21,0.624,Male,No relevent experience,Full time course,Graduate,STEM,0.0,NaN,NaN,18.0,1
72,12731,city_13,0.827,Male,Has relevent experience,no_enrollment,Graduate,STEM,2.0,10/49,Pvt Ltd,29.0,0
73,10908,city_67,0.855,Male,Has relevent experience,no_enrollment,Masters,STEM,5.0,100-500,NaN,46.0,0
74,29117,city_11,0.550,NaN,No relevent experience,Full time course,Graduate,STEM,0.0,NaN,NaN,NaN,0
75,3686,city_103,0.920,NaN,Has relevent experience,no_enrollment,Graduate,STEM,5.0,100-500,Pvt Ltd,17.0,0
76,22683,city_36,0.893,Male,Has relevent experience,no_enrollment,Masters,STEM,5.0,50-99,Pvt Ltd,65.0,0
77,22134,city_103,0.920,Male,No relevent experience,no_enrollment,Graduate,Humanities,3.0,100-500,Pvt Ltd,35.0,0
78,31765,city_67,0.855,Male,No relevent experience,Full time course,Graduate,STEM,9.0,10000+,Pvt Ltd,14.0,0
79,31449,city_103,0.920,Female,Has relevent experience,no_enrollment,Masters,STEM,2.0,<10,Early Stage Startup,4.0,0
80,5987,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,12.0,0
81,21762,city_160,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,50-99,Pvt Ltd,108.0,0
82,22070,city_103,0.920,Male,No relevent experience,no_enrollment,Graduate,STEM,20.0,NaN,NaN,136.0,0
83,25413,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,5.0,10/49,NaN,27.0,0
84,5902,city_20,0.796,NaN,Has relevent experience,Part time course,Masters,STEM,4.0,50-99,Funded Startup,74.0,0
85,28403,city_71,0.884,Male,Has relevent experience,no_enrollment,Graduate,STEM,15.0,10/49,Early Stage Startup,86.0,0
86,30937,city_57,0.866,Female,No relevent experience,Part time course,Graduate,STEM,0.0,10/49,Pvt Ltd,83.0,0
87,28751,city_103,0.920,NaN,No relevent experience,Full time course,High School,NaN,4.0,NaN,NaN,75.0,0
88,29290,city_152,0.698,Male,No relevent experience,Full time course,Masters,STEM,11.0,NaN,Public Sector,42.0,0
89,32401,city_103,0.920,Female,Has relevent experience,no_enrollment,Graduate,STEM,6.0,100-500,NaN,332.0,0
90,19128,city_61,0.913,Male,No relevent experience,Full time course,Graduate,STEM,4.0,NaN,NaN,140.0,0
91,29036,city_16,0.910,Male,No relevent experience,no_enrollment,High School,NaN,3.0,NaN,NaN,182.0,0
92,16869,city_103,0.920,Female,No relevent experience,no_enrollment,Graduate,Humanities,3.0,100-500,Pvt Ltd,13.0,1
93,10497,city_19,0.682,NaN,Has relevent experience,no_enrollment,Graduate,STEM,5.0,10/49,Pvt Ltd,172.0,1
94,18099,city_103,0.920,NaN,Has relevent experience,no_enrollment,Graduate,STEM,10.0,100-500,NGO,48.0,0
95,12081,city_65,0.802,Male,Has relevent experience,Full time course,Graduate,STEM,9.0,50-99,Pvt Ltd,33.0,0
96,7364,city_160,0.920,NaN,No relevent experience,Full time course,High School,NaN,2.0,100-500,Pvt Ltd,142.0,0
97,11184,city_74,0.579,NaN,No relevent experience,Full time course,Graduate,STEM,2.0,100-500,Pvt Ltd,34.0,0
98,7016,city_65,0.802,Male,Has relevent experience,no_enrollment,Graduate,STEM,6.0,50-99,Pvt Ltd,14.0,1
99,8695,city_11,0.550,Male,Has relevent experience,no_enrollment,Graduate,STEM,6.0,10/49,Pvt Ltd,NaN,1

In [33]:
data['gender']= 'Male'
data

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,NaN,NaN,36.0,1
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,47.0,0
2,11561,city_21,0.624,Male,No relevent experience,Full time course,Graduate,STEM,5.0,NaN,NaN,83.0,0
3,33241,city_115,0.789,Male,No relevent experience,NaN,Graduate,Business Degree,0.0,NaN,Pvt Ltd,52.0,1
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,20.0,50-99,Funded Startup,8.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14.0,NaN,NaN,42.0,1
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14.0,NaN,NaN,52.0,1
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,50-99,Pvt Ltd,44.0,0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,0.0,500-999,Pvt Ltd,97.0,0
19157,23834,city_67,0.855,Male,No relevent experience,no_enrollment,Primary School,NaN,2.0,NaN,NaN,127.0,0

In [36]:
df2 = max(data['experience'])
df2

20.0

In [37]:
df3 = min(data['training_hours'])
df3

1.0

# Data Frame

In [42]:
import pandas as pd 
import numpy as np

# dataframe using dictionary 
country = ['INDIA', 'CHINA', 'RUSSIA', 'USA', 'JAPAN']
age = [55, 45,70,65,80]
salary = [55000, 45000,90000,100000,150000]
data_frame = pd.DataFrame({'Country': country, 'Age': age, 'Salary': salary})
data_frame

  Country  Age  Salary
0   INDIA   55   55000
1   CHINA   45   45000
2  RUSSIA   70   90000
3     USA   65  100000
4   JAPAN   80  150000

In [52]:
purchase = [20000, 150000,30000,40000,50000]
data_frame1 = pd.DataFrame(purchase,columns=['purchase'])
data_frame1

   purchase
0     20000
1    150000
2     30000
3     40000
4     50000

In [53]:
data_frame2 = pd.DataFrame({'Country': country, 'Age': age, 'Salary': salary, 'Purchase':purchase})
data_frame2

  Country  Age  Salary  Purchase
0   INDIA   55   55000     20000
1   CHINA   45   45000    150000
2  RUSSIA   70   90000     30000
3     USA   65  100000     40000
4   JAPAN   80  150000     50000

In [58]:
# still do merging
data_frame3 = pd.DataFrame({'Purchase':purchase, 'Country':country})
data_frame3

   Purchase Country
0     20000   INDIA
1    150000   CHINA
2     30000  RUSSIA
3     40000     USA
4     50000   JAPAN

In [59]:
country_data = data_frame.merge(data_frame3 , how ='inner', on='Country')
country_data

  Country  Age  Salary  Purchase
0   INDIA   55   55000     20000
1   CHINA   45   45000    150000
2  RUSSIA   70   90000     30000
3     USA   65  100000     40000
4   JAPAN   80  150000     50000

In [60]:
#download csv file
country_data.to_csv('country_dataset.csv', index=False)

In [63]:
#download csv file
df1.to_csv('clean_dataset.csv', index=False)